<h1> RQ5 </h1>

In [1]:
#import libraries
import pandas as pd
import seaborn as sns
import json
import matplotlib.pyplot as plt
import numpy as np
from datetime import datetime
from bokeh.plotting import figure, output_file, show
from bokeh.models import ColumnDataSource
from bokeh.models.tools import HoverTool
import warnings
warnings.filterwarnings('ignore')

In [2]:
#read json data into pandas datframe
df_events = pd.read_json ('/users/poojacj/Desktop/adm_hw2/events/events_England.json')

In [3]:
df_events

,eventId,subEventName,tags,playerId,positions,matchId,eventName,teamId,matchPeriod,eventSec,subEventId,id
0,8,Simple pass,[{'id': 1801}],25413,"[{'y': 49, 'x': 49}, {'y': 78, 'x': 31}]",2499719,Pass,1609,1H,2.758649,85,177959171
1,8,High pass,[{'id': 1801}],370224,"[{'y': 78, 'x': 31}, {'y': 75, 'x': 51}]",2499719,Pass,1609,1H,4.946850,83,177959172
2,8,Head pass,[{'id': 1801}],3319,"[{'y': 75, 'x': 51}, {'y': 71, 'x': 35}]",2499719,Pass,1609,1H,6.542188,82,177959173
3,8,Head pass,[{'id': 1801}],120339,"[{'y': 71, 'x': 35}, {'y': 95, 'x': 41}]",2499719,Pass,1609,1H,8.143395,82,177959174
4,8,Simple pass,[{'id': 1801}],167145,"[{'y': 95, 'x': 41}, {'y': 88, 'x': 72}]",2499719,Pass,1609,1H,10.302366,85,177959175
...,...,...,...,...,...,...,...,...,...,...,...,...
643145,5,Ball out of the field,[],0,"[{'y': 32, 'x': 0}, {'y': 100, 'x': 100}]",2500098,Interruption,1623,2H,2796.732525,50,251596409
643146,3,Corner,"[{'id': 302}, {'id': 801}, {'id': 1801}]",70965,"[{'y': 100, 'x': 100}, {'y': 47, 'x': 88}]",2500098,Free Kick,1633,2H,2829.821084,30,251596232
643147,1,Air duel,"[{'id': 701}, {'id': 1802}]",7919,"[{'y': 53, 'x': 12}, {'y': 50, 'x': 14}]",2500098,Duel,1623,2H,2831.211419,10,251596410
643148,1,Air duel,"[{'id': 703}, {'id': 1801}]",8005,"[{'y': 47, 'x': 88}, {'y': 50, 'x': 86}]",2500098,Duel,1633,2H,2832.434399,10,251596234
643149,10,Shot,"[{'id': 403}, {'id': 201}, {'id': 1216}, {'id'...",8005,"[{'y': 50, 'x': 86}, {'y': 0, 'x': 0}]",2500098,Shot,1633,2H,2834.127168,100,251596236

In [4]:
#filter the event dataset on subEventName
df_events = df_events[df_events.subEventName == "Air duel"]

In [5]:
df_events.head(10)

,eventId,subEventName,tags,playerId,positions,matchId,eventName,teamId,matchPeriod,eventSec,subEventId,id
7,1,Air duel,"[{'id': 701}, {'id': 1802}]",8013,"[{'y': 15, 'x': 39}, {'y': 20, 'x': 33}]",2499719,Duel,1631,1H,14.765321,10,177959189
8,1,Air duel,"[{'id': 703}, {'id': 1801}]",0,"[{'y': 85, 'x': 61}, {'y': 80, 'x': 67}]",2499719,Duel,1609,1H,14.765321,10,177961218
12,1,Air duel,"[{'id': 703}, {'id': 1801}]",8653,"[{'y': 46, 'x': 29}, {'y': 41, 'x': 50}]",2499719,Duel,1631,1H,21.878309,10,177959191
13,1,Air duel,"[{'id': 701}, {'id': 1802}]",25413,"[{'y': 54, 'x': 71}, {'y': 59, 'x': 50}]",2499719,Duel,1609,1H,22.551816,10,177959181
27,1,Air duel,"[{'id': 703}, {'id': 1801}]",192748,"[{'y': 56, 'x': 60}, {'y': 49, 'x': 56}]",2499719,Duel,1631,1H,47.717508,10,177959210
28,1,Air duel,"[{'id': 701}, {'id': 1802}]",7945,"[{'y': 44, 'x': 40}, {'y': 51, 'x': 44}]",2499719,Duel,1609,1H,48.265872,10,177959188
60,1,Air duel,"[{'id': 701}, {'id': 1802}]",8488,"[{'y': 41, 'x': 93}, {'y': 52, 'x': 85}]",2499719,Duel,1631,1H,178.239539,10,177959246
61,1,Air duel,"[{'id': 703}, {'id': 1801}]",120339,"[{'y': 59, 'x': 7}, {'y': 48, 'x': 15}]",2499719,Duel,1609,1H,178.317724,10,177959224
89,1,Air duel,"[{'id': 701}, {'id': 1802}]",49876,"[{'y': 48, 'x': 4}, {'y': 48, 'x': 4}]",2499719,Duel,1609,1H,253.893086,10,177959248
90,1,Air duel,"[{'id': 703}, {'id': 1801}]",14763,"[{'y': 52, 'x': 96}, {'y': 52, 'x': 96}]",2499719,Duel,1631,1H,254.036308,10,177959279

In [6]:
#drop unnecessary columns
df_events = df_events.drop(['positions','matchPeriod','eventSec'], axis = 1)

In [7]:
df_events

,eventId,subEventName,tags,playerId,matchId,eventName,teamId,subEventId,id
7,1,Air duel,"[{'id': 701}, {'id': 1802}]",8013,2499719,Duel,1631,10,177959189
8,1,Air duel,"[{'id': 703}, {'id': 1801}]",0,2499719,Duel,1609,10,177961218
12,1,Air duel,"[{'id': 703}, {'id': 1801}]",8653,2499719,Duel,1631,10,177959191
13,1,Air duel,"[{'id': 701}, {'id': 1802}]",25413,2499719,Duel,1609,10,177959181
27,1,Air duel,"[{'id': 703}, {'id': 1801}]",192748,2499719,Duel,1631,10,177959210
...,...,...,...,...,...,...,...,...,...
642949,1,Air duel,"[{'id': 703}, {'id': 1801}]",37725,2500098,Duel,1633,10,251596054
643053,1,Air duel,"[{'id': 701}, {'id': 1802}]",56,2500098,Duel,1623,10,251596358
643054,1,Air duel,"[{'id': 703}, {'id': 1801}]",8313,2500098,Duel,1633,10,251596102
643147,1,Air duel,"[{'id': 701}, {'id': 1802}]",7919,2500098,Duel,1623,10,251596410
643148,1,Air duel,"[{'id': 703}, {'id': 1801}]",8005,2500098,Duel,1633,10,251596234

In [8]:
#add another column in the dataframe called "AirDuelWon" as 1 if tags = 703 otherwise 0
filtered_data = []
for i,x in df_events['tags'].items():
    for j in x:
        if j['id'] == 703:
            filtered_data.append({'index': i, 'tags': x, 'AirDuelWon': int(1)})
        elif (j['id'] == 701) | (j['id'] == 702) :
            filtered_data.append({'index': i, 'tags': x, 'AirDuelWon': int(0)})

In [9]:
filtered_data = pd.DataFrame(filtered_data)

In [10]:
filtered_data.head(10)

   index                         tags  AirDuelWon
0      7  [{'id': 701}, {'id': 1802}]           0
1      8  [{'id': 703}, {'id': 1801}]           1
2     12  [{'id': 703}, {'id': 1801}]           1
3     13  [{'id': 701}, {'id': 1802}]           0
4     27  [{'id': 703}, {'id': 1801}]           1
5     28  [{'id': 701}, {'id': 1802}]           0
6     60  [{'id': 701}, {'id': 1802}]           0
7     61  [{'id': 703}, {'id': 1801}]           1
8     89  [{'id': 701}, {'id': 1802}]           0
9     90  [{'id': 703}, {'id': 1801}]           1

In [11]:
#setting the index 
filtered_data = filtered_data.set_index('index')

In [12]:
filtered_data.head(10)

                              tags  AirDuelWon
index
7      [{'id': 701}, {'id': 1802}]           0
8      [{'id': 703}, {'id': 1801}]           1
12     [{'id': 703}, {'id': 1801}]           1
13     [{'id': 701}, {'id': 1802}]           0
27     [{'id': 703}, {'id': 1801}]           1
28     [{'id': 701}, {'id': 1802}]           0
60     [{'id': 701}, {'id': 1802}]           0
61     [{'id': 703}, {'id': 1801}]           1
89     [{'id': 701}, {'id': 1802}]           0
90     [{'id': 703}, {'id': 1801}]           1

In [13]:
#merge events and filtered dataframes on index
df_events = df_events.merge(filtered_data, left_index=True, right_index=True)

In [14]:
df_events

,eventId,subEventName,tags_x,playerId,matchId,eventName,teamId,subEventId,id,tags_y,AirDuelWon
7,1,Air duel,"[{'id': 701}, {'id': 1802}]",8013,2499719,Duel,1631,10,177959189,"[{'id': 701}, {'id': 1802}]",0
8,1,Air duel,"[{'id': 703}, {'id': 1801}]",0,2499719,Duel,1609,10,177961218,"[{'id': 703}, {'id': 1801}]",1
12,1,Air duel,"[{'id': 703}, {'id': 1801}]",8653,2499719,Duel,1631,10,177959191,"[{'id': 703}, {'id': 1801}]",1
13,1,Air duel,"[{'id': 701}, {'id': 1802}]",25413,2499719,Duel,1609,10,177959181,"[{'id': 701}, {'id': 1802}]",0
27,1,Air duel,"[{'id': 703}, {'id': 1801}]",192748,2499719,Duel,1631,10,177959210,"[{'id': 703}, {'id': 1801}]",1
...,...,...,...,...,...,...,...,...,...,...,...
642949,1,Air duel,"[{'id': 703}, {'id': 1801}]",37725,2500098,Duel,1633,10,251596054,"[{'id': 703}, {'id': 1801}]",1
643053,1,Air duel,"[{'id': 701}, {'id': 1802}]",56,2500098,Duel,1623,10,251596358,"[{'id': 701}, {'id': 1802}]",0
643054,1,Air duel,"[{'id': 703}, {'id': 1801}]",8313,2500098,Duel,1633,10,251596102,"[{'id': 703}, {'id': 1801}]",1
643147,1,Air duel,"[{'id': 701}, {'id': 1802}]",7919,2500098,Duel,1623,10,251596410,"[{'id': 701}, {'id': 1802}]",0
643148,1,Air duel,"[{'id': 703}, {'id': 1801}]",8005,2500098,Duel,1633,10,251596234,"[{'id': 703}, {'id': 1801}]",1

In [15]:
#drop unnecessary columns
df_events = df_events.drop(['eventId','subEventName','tags_x','eventName','subEventId','tags_y'], axis=1)

In [16]:
df_events

        playerId  matchId  teamId         id  AirDuelWon
7           8013  2499719    1631  177959189           0
8              0  2499719    1609  177961218           1
12          8653  2499719    1631  177959191           1
13         25413  2499719    1609  177959181           0
27        192748  2499719    1631  177959210           1
...          ...      ...     ...        ...         ...
642949     37725  2500098    1633  251596054           1
643053        56  2500098    1623  251596358           0
643054      8313  2500098    1633  251596102           1
643147      7919  2500098    1623  251596410           0
643148      8005  2500098    1633  251596234           1

[37760 rows x 5 columns]

In [17]:
#choosing the threshold value for minimum attempted air duels by calculating the average air duels attempted for a match per player
df_threshold = (df_events.groupby(['playerId', 'matchId'], as_index=False).count()
            .groupby('playerId')['AirDuelWon'].mean())

In [18]:
df_threshold

playerId
0         8.766962
36        4.230769
38        3.800000
48        5.916667
54        2.080000
            ...
447538    1.000000
447812    5.000000
448708    1.000000
486252    3.000000
531655    1.000000
Name: AirDuelWon, Length: 492, dtype: float64

In [19]:
threshold_value = df_threshold.mean()

In [20]:
df_groupby = df_events.groupby('playerId').agg({'AirDuelWon':['sum', 'count']})

In [21]:
df_groupby.columns = ['_'.join(col).strip() for col in df_groupby.columns.values]

In [22]:
#reset the index
df_result = df_groupby.reset_index()

In [23]:
df_result

     playerId  AirDuelWon_sum  AirDuelWon_count
0           0            1061              2972
1          36              23                55
2          38              11                19
3          48             137               213
4          54              15                52
..        ...             ...               ...
487    447538               0                 1
488    447812               8                15
489    448708               1                 1
490    486252              10                21
491    531655               0                 1

[492 rows x 3 columns]

In [24]:
#filtering out the data on threshold value
df_result = df_result[df_result["AirDuelWon_count"] > threshold_value]

In [25]:
#reset the index
df_result = df_result.reset_index()

In [26]:
del df_result['index']

In [27]:
#read json data into pandas datframe
df_players = pd.read_json ('/users/poojacj/Desktop/adm_hw2/players.json')[['shortName','wyId','height']]

In [28]:
df_players.head(10)

         shortName    wyId  height
0         H. Tekin   32777     187
1          M. Sarr  393228     182
2      O. Mandanda  393230     176
3       A. N'Diaye   32793     187
4   I. Konat\u00e9  393247     192
5     J. Cillessen      33     185
6  T. Alderweireld      36     187
7    J. Vertonghen      48     189
8         A. Djiku  229427     182
9       C. Eriksen      54     180

In [29]:
#rename columns to match the playerId in events dataset to wyId in players dataset
df_players.columns = ['PlayerName','playerId','height']

In [30]:
#left join the events and players datasets
df_merge_col = pd.merge(df_result, df_players, on='playerId', how='left')

In [31]:
df_merge_col.head(10)

,playerId,AirDuelWon_sum,AirDuelWon_count,PlayerName,height
0,0,1061,2972,NaN,NaN
1,36,23,55,T. Alderweireld,187.0
2,38,11,19,D. Blind,180.0
3,48,137,213,J. Vertonghen,189.0
4,54,15,52,C. Eriksen,180.0
5,56,3,8,D. Klaassen,179.0
6,74,48,109,R. Klavan,187.0
7,93,42,100,J. Gu\u00f0munds\u00adson,186.0
8,107,58,113,E. Pieters,182.0
9,116,21,54,G. Wijnaldum,175.0

In [32]:
#rename the cloumns
df_merge_col.columns = ['PlayerId','AirDuelsWon','AirDuelsAttempted','PlayerName','Height(in cm)']

In [33]:
df_merge_col.isna().sum()

PlayerId             0
AirDuelsWon          0
AirDuelsAttempted    0
PlayerName           1
Height(in cm)        1
dtype: int64

In [34]:
#drop the rows with empty player name and height
df_final = df_merge_col.dropna(axis = 0, how ='any')

In [35]:
df_final

     PlayerId  AirDuelsWon  AirDuelsAttempted       PlayerName  Height(in cm)
1          36           23                 55  T. Alderweireld          187.0
2          38           11                 19         D. Blind          180.0
3          48          137                213    J. Vertonghen          189.0
4          54           15                 52       C. Eriksen          180.0
5          56            3                  8      D. Klaassen          179.0
..        ...          ...                ...              ...            ...
448    434159           11                 21         S. Field          185.0
449    442211           20                 40        A. Sabiri          183.0
450    447379            1                  6     B. Baningime          178.0
451    447812            8                 15       T. Edwards          175.0
452    486252           10                 21   A. Wan-Bissaka          183.0

[452 rows x 5 columns]

In [36]:
df_final["ratio"] = df_final["AirDuelsWon"] / df_final["AirDuelsAttempted"]

In [37]:
#sort the columns in descending order of ratio
df_final = df_final.sort_values(by='ratio', ascending=False)

In [38]:
df_final

,PlayerId,AirDuelsWon,AirDuelsAttempted,PlayerName,Height(in cm),ratio
354,104851,5,5,M. D\u00fabravka,191.0,1.000000
274,25662,6,6,D. Ospina,183.0,1.000000
146,8425,14,14,W. Hennessey,198.0,1.000000
179,8826,10,10,K. Darlow,185.0,1.000000
218,10131,26,27,J. Pickford,185.0,0.962963
...,...,...,...,...,...,...
27,3319,0,17,M. \u00d6zil,180.0,0.000000
127,8296,0,21,J. Defoe,171.0,0.000000
29,3326,0,11,Jes\u00e9 Rodr\u00edguez,178.0,0.000000
31,3348,0,7,Deulofeu,177.0,0.000000
107,8140,0,7,A. Lallana,172.0,0.000000

In [39]:
#creating buckets based on the height
bins = [160, 170, 180, 190, 200, 210]
labels =[1,2,3,4,5]
labels_cm = ["160-170","170-180","180-190","190-200","200-210"]
df_final['binned'] = pd.cut(df_final['Height(in cm)'], bins,labels=labels)
df_final['bins'] = pd.cut(df_final['Height(in cm)'],bins,labels=labels_cm )
print (df_final)

     PlayerId  AirDuelsWon  AirDuelsAttempted                PlayerName  \
354    104851            5                  5          M. D\u00fabravka
274     25662            6                  6                 D. Ospina
146      8425           14                 14              W. Hennessey
179      8826           10                 10                 K. Darlow
218     10131           26                 27               J. Pickford
..        ...          ...                ...                       ...
27       3319            0                 17              M. \u00d6zil
127      8296            0                 21                  J. Defoe
29       3326            0                 11  Jes\u00e9 Rodr\u00edguez
31       3348            0                  7                  Deulofeu
107      8140            0                  7                A. Lallana

     Height(in cm)     ratio binned     bins
354          191.0  1.000000      4  190-200
274          183.0  1.000000      3  180-190
146          198.0  1.000000      4  190-200
179          185.0  1.000000      3  180-190
218          185.0  0.962963      3  180-190
..             ...       ...    ...      ...
27           180.0  0.000000      2  170-180
127          171.0  0.000000      2  170-180
29           178.0  0.000000      2  170-180
31           177.0  0.000000      2  170-180
107          172.0  0.000000      2  170-180

[452 rows x 8 columns]

In [40]:
# name the output file of the scatterplot
output_file('RQ5_scatterplot.html')

In [41]:
#creating another column with the colour mapped for each bucket
colormap = {1: '#fff9bd',
            2: '#a9cdff',
            3: '#70c7c1',
            4: '#f08c8c',
            5: '#f0c7ff'}
# colors = [colormap[x] for x in df_final['binned']]
df_final['color'] = df_final['binned'].map(lambda x: colormap[x])

In [42]:
df_final['color']

354    #f08c8c
274    #70c7c1
146    #f08c8c
179    #70c7c1
218    #70c7c1
        ...
27     #a9cdff
127    #a9cdff
29     #a9cdff
31     #a9cdff
107    #a9cdff
Name: color, Length: 452, dtype: category
Categories (5, object): [#fff9bd < #a9cdff < #70c7c1 < #f08c8c < #f0c7ff]

In [43]:
df_final

,PlayerId,AirDuelsWon,AirDuelsAttempted,PlayerName,Height(in cm),ratio,binned,bins,color
354,104851,5,5,M. D\u00fabravka,191.0,1.000000,4,190-200,#f08c8c
274,25662,6,6,D. Ospina,183.0,1.000000,3,180-190,#70c7c1
146,8425,14,14,W. Hennessey,198.0,1.000000,4,190-200,#f08c8c
179,8826,10,10,K. Darlow,185.0,1.000000,3,180-190,#70c7c1
218,10131,26,27,J. Pickford,185.0,0.962963,3,180-190,#70c7c1
...,...,...,...,...,...,...,...,...,...
27,3319,0,17,M. \u00d6zil,180.0,0.000000,2,170-180,#a9cdff
127,8296,0,21,J. Defoe,171.0,0.000000,2,170-180,#a9cdff
29,3326,0,11,Jes\u00e9 Rodr\u00edguez,178.0,0.000000,2,170-180,#a9cdff
31,3348,0,7,Deulofeu,177.0,0.000000,2,170-180,#a9cdff
107,8140,0,7,A. Lallana,172.0,0.000000,2,170-180,#a9cdff

In [44]:
#take the resultant dataframe as samples based on bins
sample1 = df_final[df_final["binned"] == 1]
source1 = ColumnDataSource(sample1)
sample2 = df_final[df_final["binned"] == 2]
source2 = ColumnDataSource(sample2)
sample3 = df_final[df_final["binned"] == 3]
source3 = ColumnDataSource(sample3)
sample4 = df_final[df_final["binned"] == 4]
source4 = ColumnDataSource(sample4)
sample5 = df_final[df_final["binned"] == 5]
source5 = ColumnDataSource(sample5)

In [45]:
#plot the scatterplot marking the legend
p = figure(plot_width=1200, plot_height=800,background_fill_color='black')
p.circle(x="Height(in cm)", y="ratio",
         source=source1,
         size=7, color = "color", legend = "160cm - 170cm")
p.circle(x="Height(in cm)", y="ratio",
         source=source2,
         size=7, color = "color", legend = "170cm - 180cm")
p.circle(x="Height(in cm)", y="ratio",
         source=source3,
         size=7, color = "color", legend = "180cm - 190cm")
p.circle(x="Height(in cm)", y="ratio",
         source=source4,
         size=7, color = "color", legend = "190cm - 200cm")
p.circle(x="Height(in cm)", y="ratio",
         source=source5,
         size=7, color = "color", legend = "200cm - 210cm" )

# change just some things about the x-grid
p.xgrid.grid_line_color = "#636363"
# change just some things about the y-grid
p.ygrid.grid_line_color = "#636363"
p.legend.location = "bottom_right"
p.legend.border_line_width = 3
p.legend.border_line_color = "black"
p.legend.border_line_alpha = 0.5

In [46]:
#set the title and x and y labels
p.title.text = "Distribution of height and air duels for each player in the English Premier league"
p.xaxis.axis_label = "Height (in cm)"
p.yaxis.axis_label = "Ratio of air duels won to air duels attempted"

In [55]:
#show player name on hover
hover = HoverTool()
hover.tooltips=[
    ('Player Name', '@PlayerName')
]
p.add_tools(hover)
output_file("rq5_scatterplot.html")
show(p)